In [13]:
import pandas as pd

In [14]:
my_series = pd.Series([1, 6, -2, 3.5, -2, 0])

In [15]:
my_series

0    1.0
1    6.0
2   -2.0
3    3.5
4   -2.0
5    0.0
dtype: float64

In [16]:
#Значение по индексу
my_series[1]

6.0

In [17]:
#Срез по индексу
my_series[:2]

0    1.0
1    6.0
dtype: float64

In [18]:
#Фильтрация серии
my_series[my_serios > 0]

0    1.0
1    6.0
3    3.5
dtype: float64

In [19]:
#Математические действия с серией
my_series *2

0     2.0
1    12.0
2    -4.0
3     7.0
4    -4.0
5     0.0
dtype: float64

In [20]:
import numpy as np

In [21]:
#Подсчет экспоненты
np.exp(my_series)

0      2.718282
1    403.428793
2      0.135335
3     33.115452
4      0.135335
5      1.000000
dtype: float64

In [22]:
#Суммирование серии
np.sum(my_series)

6.5

In [34]:
df = pd.DataFrame({
    'name' : ['Маша', 'Вася', 'Эдуард'],
    'age' : [25, 8, 48],
    'job' : ['Программист', 'Школьник', 'Big Boss'],
    'salary' : [100, 10, 200]
}, index=['some', 'random', 'words'])

In [35]:
df

          name  age          job  salary
some      Маша   25  Программист     100
random    Вася    8     Школьник      10
words   Эдуард   48     Big Boss     200

In [36]:
name = df['name']

In [37]:
name

some        Маша
random      Вася
words     Эдуард
Name: name, dtype: object

In [38]:
df[df['salary']>=100]

         name  age          job  salary
some     Маша   25  Программист     100
words  Эдуард   48     Big Boss     200

In [39]:
df['salary'] *= 10

In [40]:
df

          name  age          job  salary
some      Маша   25  Программист    1000
random    Вася    8     Школьник     100
words   Эдуард   48     Big Boss    2000

In [41]:
df['salary']/2

some       500.0
random      50.0
words     1000.0
Name: salary, dtype: float64

In [43]:
#Срез (loc - обращение к строкам по индексу)
df.loc['some':'random']

        name  age          job  salary
some    Маша   25  Программист    1000
random  Вася    8     Школьник     100

In [42]:
df

          name  age          job  salary
some      Маша   25  Программист    1000
random    Вася    8     Школьник     100
words   Эдуард   48     Big Boss    2000

In [44]:
#Срез (iloc - обращение к строкам по номерам строк)
df.iloc[1]

name          Вася
age              8
job       Школьник
salary         100
Name: random, dtype: object

In [46]:
#DataFrame
df.iloc[:1]

      name  age          job  salary
some  Маша   25  Программист    1000

In [47]:
#Транспонирование
df.T

               some    random     words
name           Маша      Вася    Эдуард
age              25         8        48
job     Программист  Школьник  Big Boss
salary         1000       100      2000